src/config/Documents/СозданиеПрограммПоКованнымДискам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>СозданиеПрограммПоКованнымДискам</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипоРазмер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Типоразмеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МоделиТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКПрограмме</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/Documents/СозданиеПрограммПоКованнымДискам/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// нет ли дублей строк
	
	Проверка = Товары.Выгрузить();
	Проверка.Свернуть("Типоразмер,модель");
	Если Товары.Количество()<> Проверка.Количество() тогда
		Сообщить("В документе указанно несколько строк с одинаковым типоразмером и моделью!"); 
		Отказ = Истина;
	конецЕсли;	
	
	//не было ли  в предыдущих документах такого
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таб.Типоразмер,
	|	Таб.Модель
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&Таб КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СозданиеПрограммПоКованнымДискамТовары.ТипоРазмер,
	|	СозданиеПрограммПоКованнымДискамТовары.Модель
	|ПОМЕСТИТЬ УжеБыло
	|ИЗ
	|	Документ.СозданиеПрограммПоКованнымДискам.Товары КАК СозданиеПрограммПоКованнымДискамТовары
	|ГДЕ
	|	СозданиеПрограммПоКованнымДискамТовары.Ссылка <> &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Типоразмер,
	|	ВТ.Модель
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ УжеБыло КАК УжеБыло
	|		ПО ВТ.Типоразмер = УжеБыло.ТипоРазмер
	|			И ВТ.Модель = УжеБыло.Модель
	|ГДЕ
	|	НЕ УжеБыло.ТипоРазмер ЕСТЬ NULL 
	|	И НЕ УжеБыло.Модель ЕСТЬ NULL ";
	
	Запрос.УстановитьПараметр("Таб", Товары);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Если не результат.Пустой() тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			сообщить("По типоразмеру "+выборка.типоразмер+" и модели "+Выборка.Модель+" уже есть данные о программе! ");	
			отказ = истина;
			
			
		КонецЦикла;
	конецесли;
	
	Если не Отказ тогда
	//запишем веса
	Для каждого стр из товары цикл
	ВыборкаЕд = справочники.ЕдиницыИзмерения.Выбрать(,стр.Номенклатура,,);
	ВыборкаЕд.Следующий();
	Ед = ВыборкаЕд.ПолучитьОбъект();
	Ед.Вес = стр.Вес;
	Ед.Записать();
		
	конеццикла;	
	конецЕсли;
	
	
	
КонецПроцедуры
